weather_cpp/catkin_ws/src/weather_cpp/include/weather_cpp/ndfdXMLBinding.LatLonListCityNames.req.xml

<?xml version="1.0" encoding="UTF-8"?>
<SOAP-ENV:Envelope
  xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/"
  xmlns:SOAP-ENC="http://schemas.xmlsoap.org/soap/encoding/"
  xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"
  xmlns:xsd="http://www.w3.org/2001/XMLSchema"
  xmlns:ns2="http://graphical.weather.gov/xml/DWMLgen/schema/DWML.xsd"
  xmlns:ns1="http://graphical.weather.gov/xml/DWMLgen/wsdl/ndfdXML.wsdl">
 <SOAP-ENV:Body  SOAP-ENV:encodingStyle="http://schemas.xmlsoap.org/soap/encoding/">
  <ns1:LatLonListCityNames>
   <displayLevel>1</displayLevel>
  </ns1:LatLonListCityNames>
 </SOAP-ENV:Body>
</SOAP-ENV:Envelope>
